---
type: MechanicalSystem
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 10
tags: [revit-api, class]
---

# MechanicalSystem

`Autodesk.Revit.DB.Mechanical.MechanicalSystem` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | GetFlow | 2017 | `public double GetFlow ()` |
| Method | GetStaticPressure | 2017 | `public double GetStaticPressure ()` |
| Method | IsPressureDropServerMissing | 2014 | `public bool IsPressureDropServerMissing ()` |
| Method | Remove | — | `` |
| Property | BaseEquipmentConnector | — | `public Connector BaseEquipmentConnector { get ; set ; }` |
| Property | DuctNetwork | — | `public ElementSet DuctNetwork { get ; }` |
| Property | IsWellConnected | 2011 | `public bool IsWellConnected { get ; }` |
| Property | Parameter | — | `` |
| Property | SystemType | — | `public DuctSystemType SystemType { get ; }` |